finalpresentation.org
#+STARTUP: indent
* Title
- Evaluation of PC-Set Similarity Measures for Tonal Analysis
* Outline
-
-
-
* Introduction
** Tonal Analysis
1. describe/model
2. find patterns
** Pitch Class Set Theory
- a descriptive tool
** Similarity Measures
- what?
  - theoretical models
  - different approaches
- similarity is important
  - dimensionality
  - visualisation (distance)
  - perception
* Tonal Analysis
1. describe/model
   - describe what?
     - describe musical surface
   - describe how?
     - systematically
2. find patterns
   - visualise data
   - retrieve traditional musicology
   - augment traditional musicology
* Pitch Class Set Theory
** Introduction
- what?
  - pitches as numbers
  - equivelance relations
- Why?
  - mid level description
  - systematic
  - perceptual relevant
** Basics
- Pitch class
- PC-set
- Set Class
- SC Similarity
* Similarity Measures
** Introduction
- What?
  - theoretical models of similarity
  - many different models and approaches
- Why?
  - visualisation
** Total Measures
- Subset vector based
- consider subsets of all sizes
- 6 total measures
* Pitch Class Set Analysis
** Basics
- segment
- describe each segment
- visualise
** Previous Work
- class scape
- work in midi domain
* Segmentation
- why is it important (timing/scale of oberservation)
- two segmentation policies
  1. systematic segmentation
     - retrieve the entire sc contents of a piece
  2. sliding window
     - for visualisation
** Example
- complete sc contents example
* Visualisation
** Distance Plot
- what?
  - time series of distances between segments and comparison set
- how?
  - segmentation (window and hop size selection)
  - comparison set selection
- peaks
- recurring patterns in the curve
** autocorrelation
- autocorrelate distance plot
- peaks
- reveals structure
- example plot
** Self-similarity matrix
- no comparison set
- systematically compare all segments
- reveals structure
- example plot
* Analysis Tool
- many parameters
- exploratory tool
- demonstration
* Conclusions
- systematic mid-level descriptions are a starting point for many
  applications
- pc set theory
- similarity measures
- visualisation techniques
- analysis tool
* Future work
- 
- 
- 
