finalpresentation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>finalpresentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="finalpresentation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-07-02T14:11+0200"/>
<meta name="author" content="Nick"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">finalpresentation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Title</a></li>
<li><a href="#sec-2">2 Outline</a></li>
<li><a href="#sec-3">3 Introduction</a>
<ul>
<li><a href="#sec-3-1">3.1 Tonal Analysis</a></li>
<li><a href="#sec-3-2">3.2 Pitch Class Set Theory</a></li>
<li><a href="#sec-3-3">3.3 Similarity Measures</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Tonal Analysis</a></li>
<li><a href="#sec-5">5 Pitch Class Set Theory</a>
<ul>
<li><a href="#sec-5-1">5.1 Introduction</a></li>
<li><a href="#sec-5-2">5.2 Basics</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Similarity Measures</a>
<ul>
<li><a href="#sec-6-1">6.1 Introduction</a></li>
<li><a href="#sec-6-2">6.2 Total Measures</a></li>
</ul>
</li>
<li><a href="#sec-7">7 Pitch Class Set Analysis</a>
<ul>
<li><a href="#sec-7-1">7.1 Basics</a></li>
<li><a href="#sec-7-2">7.2 Previous Work</a></li>
</ul>
</li>
<li><a href="#sec-8">8 Segmentation</a>
<ul>
<li><a href="#sec-8-1">8.1 Example</a></li>
</ul>
</li>
<li><a href="#sec-9">9 Visualisation</a>
<ul>
<li><a href="#sec-9-1">9.1 Distance Plot</a></li>
<li><a href="#sec-9-2">9.2 autocorrelation</a></li>
<li><a href="#sec-9-3">9.3 Self-similarity matrix</a></li>
</ul>
</li>
<li><a href="#sec-10">10 Analysis Tool</a></li>
<li><a href="#sec-11">11 Conclusions</a></li>
<li><a href="#sec-12">12 Future work</a></li>
<li><a href="#sec-13">13 New Presentation Outline</a>
<ul>
<li><a href="#sec-13-1">13.1 Title Slide</a></li>
<li><a href="#sec-13-2">13.2 Introduction</a>
<ul>
<li><a href="#sec-13-2-1">13.2.1 Definitions</a></li>
<li><a href="#sec-13-2-2">13.2.2 Problem</a></li>
<li><a href="#sec-13-2-3">13.2.3 Objectives</a></li>
</ul>
</li>
<li><a href="#sec-13-3">13.3 Systematic Description</a></li>
<li><a href="#sec-13-4">13.4 Set Class Theory</a>
<ul>
<li><a href="#sec-13-4-1">13.4.1 Basics</a></li>
<li><a href="#sec-13-4-2">13.4.2 Justify and position</a></li>
</ul>
</li>
<li><a href="#sec-13-5">13.5 Similarity Measures</a>
<ul>
<li><a href="#sec-13-5-1">13.5.1 Introduction</a></li>
<li><a href="#sec-13-5-2">13.5.2 Survey</a></li>
<li><a href="#sec-13-5-3">13.5.3 Total Measures</a></li>
</ul>
</li>
<li><a href="#sec-13-6">13.6 Set Class Analysis</a></li>
<li><a href="#sec-13-7">13.7 Segmentation</a>
<ul>
<li><a href="#sec-13-7-1">13.7.1 Systematic</a></li>
<li><a href="#sec-13-7-2">13.7.2 Sliding Window</a></li>
</ul>
</li>
<li><a href="#sec-13-8">13.8 Representation</a>
<ul>
<li><a href="#sec-13-8-1">13.8.1 Distance Plot</a></li>
<li><a href="#sec-13-8-2">13.8.2 autocorrelation</a></li>
<li><a href="#sec-13-8-3">13.8.3 Self-similarity matrix</a></li>
</ul>
</li>
<li><a href="#sec-13-9">13.9 Analysis Tool</a></li>
<li><a href="#sec-13-10">13.10 Conclusions</a></li>
<li><a href="#sec-13-11">13.11 Future work</a></li>
</ul>
</li>
<li><a href="#sec-14">14 Agustin Comments</a></li>
<li><a href="#sec-15">15 Presentation Script</a>
<ul>
<li><a href="#sec-15-1">15.1 Title slide</a></li>
<li><a href="#sec-15-2">15.2 outline</a></li>
<li><a href="#sec-15-3">15.3 Introduxtion - Definitions</a></li>
<li><a href="#sec-15-4">15.4 Problem</a></li>
<li><a href="#sec-15-5">15.5 Objectives</a></li>
<li><a href="#sec-15-6">15.6 Systematic Description</a></li>
<li><a href="#sec-15-7">15.7 Set Class Theory - What?</a></li>
<li><a href="#sec-15-8">15.8 Set Class Theory - Why?</a></li>
<li><a href="#sec-15-9">15.9 Similarity Measures - What?</a></li>
<li><a href="#sec-15-10">15.10 Similarity Measures - Survey</a></li>
<li><a href="#sec-15-11">15.11 Similarity Measures - survey 2</a></li>
<li><a href="#sec-15-12">15.12 Segmentation</a></li>
<li><a href="#sec-15-13">15.13 Systematic Segmentation</a></li>
<li><a href="#sec-15-14">15.14 Class Matrix and vector</a></li>
<li><a href="#sec-15-15">15.15 Sliding Window</a></li>
<li><a href="#sec-15-16">15.16 Sliding window card avg</a></li>
<li><a href="#sec-15-17">15.17 Sliding window sc avg</a></li>
<li><a href="#sec-15-18">15.18 Sliding window class vec + slding content</a></li>
<li><a href="#sec-15-19">15.19 Representation</a></li>
<li><a href="#sec-15-20">15.20 Distance Plot</a></li>
<li><a href="#sec-15-21">15.21 Autocorrelation</a></li>
<li><a href="#sec-15-22">15.22 Self-Similarity Matrix</a></li>
<li><a href="#sec-15-23">15.23 Analysis Tool</a></li>
<li><a href="#sec-15-24">15.24 Conclusions</a></li>
<li><a href="#sec-15-25">15.25 Future Work</a></li>
</ul>
</li>
<li><a href="#sec-16">16 Presentation Script again</a>
<ul>
<li><a href="#sec-16-1">16.1 Introduction</a>
<ul>
<li><a href="#sec-16-1-1">16.1.1 Definitions</a></li>
<li><a href="#sec-16-1-2">16.1.2 Problem</a></li>
<li><a href="#sec-16-1-3">16.1.3 Objectives</a></li>
</ul>
</li>
<li><a href="#sec-16-2">16.2 Methodology</a>
<ul>
<li><a href="#sec-16-2-1">16.2.1 Systematic description</a></li>
<li><a href="#sec-16-2-2">16.2.2 Set class theory - what?</a></li>
<li><a href="#sec-16-2-3">16.2.3 Set class theory - why?</a></li>
<li><a href="#sec-16-2-4">16.2.4 Set Class Similarity Measures - What and Why</a></li>
<li><a href="#sec-16-2-5">16.2.5 Set Class Similarity Measures - Survey</a></li>
<li><a href="#sec-16-2-6">16.2.6 Segmentation</a></li>
<li><a href="#sec-16-2-7">16.2.7 Segmentation - Fully systematic</a></li>
<li><a href="#sec-16-2-8">16.2.8 Segmentation - Fully Systematic</a></li>
<li><a href="#sec-16-2-9">16.2.9 Segmentation - Sliding window</a></li>
<li><a href="#sec-16-2-10">16.2.10 segmentation - sliding window</a></li>
<li><a href="#sec-16-2-11">16.2.11 Segmentation - sliding window</a></li>
</ul>
</li>
<li><a href="#sec-16-3">16.3 Representaion</a>
<ul>
<li><a href="#sec-16-3-1">16.3.1 Representation</a></li>
<li><a href="#sec-16-3-2">16.3.2 Distance plot</a></li>
<li><a href="#sec-16-3-3">16.3.3 Autocorrelation</a></li>
<li><a href="#sec-16-3-4">16.3.4 SSM</a></li>
<li><a href="#sec-16-3-5">16.3.5 Analysis Tool</a></li>
</ul>
</li>
<li><a href="#sec-16-4">16.4 Conclusions</a></li>
<li><a href="#sec-16-5">16.5 Further Work</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Title</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Evaluation of PC-Set Similarity Measures for Tonal Analysis
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Outline</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
</li>
<li>
</li>
<li>
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Introduction</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Tonal Analysis</h3>
<div class="outline-text-3" id="text-3-1">

<ol>
<li>describe/model
</li>
<li>find patterns
</li>
</ol>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Pitch Class Set Theory</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>a descriptive tool
</li>
</ul>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Similarity Measures</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>what?
<ul>
<li>theoretical models
</li>
<li>different approaches
</li>
</ul>

</li>
<li>similarity is important
<ul>
<li>dimensionality
</li>
<li>visualisation (distance)
</li>
<li>perception
</li>
</ul>

</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Tonal Analysis</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>describe/model
<ul>
<li>describe what?
<ul>
<li>describe musical surface
</li>
</ul>

</li>
<li>describe how?
<ul>
<li>systematically
</li>
</ul>

</li>
</ul>

</li>
<li>find patterns
<ul>
<li>visualise data
</li>
<li>retrieve traditional musicology
</li>
<li>augment traditional musicology
</li>
</ul>

</li>
</ol>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Pitch Class Set Theory</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Introduction</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>what?
<ul>
<li>pitches as numbers
</li>
<li>equivelance relations
</li>
</ul>

</li>
<li>Why?
<ul>
<li>mid level description
</li>
<li>systematic
</li>
<li>perceptual relevant
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Basics</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>Pitch class
</li>
<li>PC-set
</li>
<li>Set Class
</li>
<li>SC Similarity
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Similarity Measures</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Introduction</h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li>What?
<ul>
<li>theoretical models of similarity
</li>
<li>many different models and approaches
</li>
</ul>

</li>
<li>Why?
<ul>
<li>visualisation
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Total Measures</h3>
<div class="outline-text-3" id="text-6-2">

<ul>
<li>Subset vector based
</li>
<li>consider subsets of all sizes
</li>
<li>6 total measures
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Pitch Class Set Analysis</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Basics</h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>segment
</li>
<li>describe each segment
</li>
<li>visualise
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Previous Work</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li>class scape
</li>
<li>work in midi domain
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Segmentation</h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>why is it important (timing/scale of oberservation)
</li>
<li>two segmentation policies
<ol>
<li>systematic segmentation
<ul>
<li>retrieve the entire sc contents of a piece
</li>
</ul>

</li>
<li>sliding window
<ul>
<li>for visualisation
</li>
</ul>

</li>
</ol>

</li>
</ul>


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Example</h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>complete sc contents example
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Visualisation</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Distance Plot</h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>what?
<ul>
<li>time series of distances between segments and comparison set
</li>
</ul>

</li>
<li>how?
<ul>
<li>segmentation (window and hop size selection)
</li>
<li>comparison set selection
</li>
</ul>

</li>
<li>peaks
</li>
<li>recurring patterns in the curve
</li>
</ul>

</div>

</div>
