finalpresentation.org
* New Presentation Outline
** Title Slide
- name
- title
** Introduction
*** Definitions
BRIEFLY EXPLAIN THE TITLE AS A ANTECEDENT TO THE PROBLEMS AND
OBJECTIVES.
- Tonal Analysis:
    1. description
    2. representation
- Set class theory
  - tool for the description stage
- Similarity measures
  - tool for the representation stage
*** Problem
EXPLAIN THE TWO MAIN ASPECTS OF THE RESEARCH PROBLEM
1. Existing descriptions of tonality lack depth
   - chord and key
   - template matching
   - major-minor paradigm
2. Use of non-musical similarity measures
   - euclidean distance
   - correlation
   - counter-intuitive
   - not musically or perceptually relevant
SEMANTIC GAP
*** Objectives
1. SYSTEMATIC description of tonality
   - To adopt a SYSTEMATIC approach to description of tonality.
2. Use Set class theory
   - To justify set class analysis as a systematic descriptive tool
     capable of relating useful musical information as well as having
     a degree of perceptual relevance.
   - To position set class analysis among existing methods of tonal
     description such as chroma vector time-series.
3. Survey set class similarity measures
   - comprehensive and practical
   - To examine the measures in terms of systematicity and perceptual
     relevance.
4. To develop techniques for the representation of set class
   information
   - appropriate representations of the data from set class
     descriptions so as to expose meaningful musical information.
5. To utilise set class similarity in these representations.
6. To evaluate the analytical potential of this approach
   - The analytical potential of the model will be evidenced through
     specific analysis examples.
   - these examples will constitue preliminary experiments and
     exploration of the techniques. a proof of concept.
** Systematic Description
OBJECTIVE 1: WHAT DOES IT MEAN TO BE SYSTEMATIC.
- mid-level approach
- musical surface of notes
** Set Class Theory
THE TOOL USED FOR SYSTEMATIC DESCRIPTION
*** Basics
DESCRIBE THE BASIC PRINCIPLES IN SET CLASS THEORY.
- Pitch class
- PC-set
- Set Class
*** Justify and position
OBJECTIVES 2
- systematic
- capable of describing the musical surface
- perceptual relevance
- how is it different to existing approaches?
- benefits?
** Similarity Measures
TOOL FOR REPRESENTATION
*** Introduction
- What?
  - theoretical models of similarity
  - many different models and approaches
  - why are there so many models.
  - what do they measure
- Why?
  - EXPLAIN WHY SIMILARITY MEASURES ARE IMPORTANT IN GENERAL.
  - visualisation
*** Survey
OBJECTIVE 3
- surveyed how
- outcomes
*** Total Measures
- Subset vector based
- consider subsets of all sizes
- 6 total measures
- example plot of chord comparisons
- general conclusions
- this will be used later
** Set Class Analysis
- basic steps
  - Desrcibe/model
    - segment
    - describe each segment with its SC
  - representation
    - find a appropriate representation of the data
    - visualise
- not much previous work has been done
  - class scapes
- segmentations is a crucial 
** Segmentation
THIS IS THE MOST IMPORTANT STAGE
- why is it important (timing/scale of oberservation)
  - the segment size determines the size of the sets
- two segmentation policies to be used in conjunction
  1. fully systematic segmentation
     - retrieve the entire sc contents of a piece
  2. sliding window
     - for represntation stage
     - tune in to sets of interest
*** Systematic
- how?
- class-scape
- class matrix
- class vector
- Example class matrix and class vector for bach prelude
- what do they show?
*** Sliding Window
- window and hop size selection
- what are the sets of interest?
- window and hop size can be informed by the previous plots
- Example: Average seg size for SCs and card
- choose 3 and 4 note chords
- Example: class vector with superimposed sliding window contents
** Representation
*** Distance Plot
- what?
  - represents tonal change in time "with respect to specific sets"
- how?
  - segmentation (window and hop size selection)
  - comparison set selection
  - what are the sets of interest and why?
- peaks
- recurring patterns in the curve
*** autocorrelation
- autocorrelate distance plot
- peaks
- reveals structure
- example plot
*** Self-similarity matrix
- no comparison set
- systematically compare all segments
- reveals structure
- example plot
** Analysis Tool
- many parameters
- exploratory tool
- demonstration
  - cadential sets
  - diatonic set
  - chromatic sets
  - 8-23
  - different measures
** Conclusions
- systematic mid-level descriptions are a starting point for many
  applications
- pc set theory
- similarity measures
- visualisation techniques
- analysis tool
** Future work
- 
