finalpresentation.html

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> autocorrelation</h3>
<div class="outline-text-3" id="text-9-2">

<ul>
<li>autocorrelate distance plot
</li>
<li>peaks
</li>
<li>reveals structure
</li>
<li>example plot
</li>
</ul>

</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Self-similarity matrix</h3>
<div class="outline-text-3" id="text-9-3">

<ul>
<li>no comparison set
</li>
<li>systematically compare all segments
</li>
<li>reveals structure
</li>
<li>example plot
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Analysis Tool</h2>
<div class="outline-text-2" id="text-10">

<ul>
<li>many parameters
</li>
<li>exploratory tool
</li>
<li>demonstration
</li>
</ul>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Conclusions</h2>
<div class="outline-text-2" id="text-11">

<ul>
<li>systematic mid-level descriptions are a starting point for many
  applications
</li>
<li>pc set theory
</li>
<li>similarity measures
</li>
<li>visualisation techniques
</li>
<li>analysis tool
</li>
</ul>

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Future work</h2>
<div class="outline-text-2" id="text-12">

<ul>
<li>
</li>
<li>
</li>
<li>
</li>
</ul>

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> New Presentation Outline</h2>
<div class="outline-text-2" id="text-13">


</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> Title Slide</h3>
<div class="outline-text-3" id="text-13-1">

<ul>
<li>name
</li>
<li>title
</li>
</ul>

</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> Introduction</h3>
<div class="outline-text-3" id="text-13-2">


</div>

<div id="outline-container-13-2-1" class="outline-4">
<h4 id="sec-13-2-1"><span class="section-number-4">13.2.1</span> Definitions</h4>
<div class="outline-text-4" id="text-13-2-1">

<p>BRIEFLY EXPLAIN THE TITLE AS A ANTECEDENT TO THE PROBLEMS AND
OBJECTIVES.
</p><ul>
<li>Tonal Analysis:
<ol>
<li>description
</li>
<li>representation
</li>
</ol>

</li>
<li>Set class theory
<ul>
<li>tool for the description stage
</li>
</ul>

</li>
<li>Similarity measures
<ul>
<li>tool for the representation stage
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-13-2-2" class="outline-4">
<h4 id="sec-13-2-2"><span class="section-number-4">13.2.2</span> Problem</h4>
<div class="outline-text-4" id="text-13-2-2">

<p>EXPLAIN THE TWO MAIN ASPECTS OF THE RESEARCH PROBLEM
</p><ol>
<li>Existing descriptions of tonality lack depth
<ul>
<li>chord and key
</li>
<li>template matching
</li>
<li>major-minor paradigm
</li>
</ul>

</li>
<li>Use of non-musical similarity measures
<ul>
<li>euclidean distance
</li>
<li>correlation
</li>
<li>counter-intuitive
</li>
<li>not musically or perceptually relevant
</li>
</ul>

</li>
</ol>

<p>SEMANTIC GAP
</p></div>

</div>

<div id="outline-container-13-2-3" class="outline-4">
<h4 id="sec-13-2-3"><span class="section-number-4">13.2.3</span> Objectives</h4>
<div class="outline-text-4" id="text-13-2-3">

<ol>
<li>SYSTEMATIC description of tonality
<ul>
<li>To adopt a SYSTEMATIC approach to description of tonality.
</li>
</ul>

</li>
<li>Use Set class theory
<ul>
<li>To justify set class analysis as a systematic descriptive tool
     capable of relating useful musical information as well as having
     a degree of perceptual relevance.
</li>
<li>To position set class analysis among existing methods of tonal
     description such as chroma vector time-series.
</li>
</ul>

</li>
<li>Survey set class similarity measures
<ul>
<li>comprehensive and practical
</li>
<li>To examine the measures in terms of systematicity and perceptual
     relevance.
</li>
</ul>

</li>
<li>To develop techniques for the representation of set class
   information
<ul>
<li>appropriate representations of the data from set class
     descriptions so as to expose meaningful musical information.
</li>
</ul>

</li>
<li>To utilise set class similarity in these representations.
</li>
<li>To evaluate the analytical potential of this approach
<ul>
<li>The analytical potential of the model will be evidenced through
     specific analysis examples.
</li>
<li>these examples will constitue preliminary experiments and
     exploration of the techniques. a proof of concept.
</li>
</ul>

</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> Systematic Description</h3>
<div class="outline-text-3" id="text-13-3">

<p>OBJECTIVE 1: WHAT DOES IT MEAN TO BE SYSTEMATIC.
</p><ul>
<li>mid-level approach
</li>
<li>musical surface of notes
</li>
</ul>

</div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> Set Class Theory</h3>
<div class="outline-text-3" id="text-13-4">

<p>THE TOOL USED FOR SYSTEMATIC DESCRIPTION
</p>
</div>

<div id="outline-container-13-4-1" class="outline-4">
<h4 id="sec-13-4-1"><span class="section-number-4">13.4.1</span> Basics</h4>
<div class="outline-text-4" id="text-13-4-1">

<p>DESCRIBE THE BASIC PRINCIPLES IN SET CLASS THEORY.
</p><ul>
<li>Pitch class
</li>
<li>PC-set
</li>
<li>Set Class
</li>
</ul>

</div>

</div>

<div id="outline-container-13-4-2" class="outline-4">
<h4 id="sec-13-4-2"><span class="section-number-4">13.4.2</span> Justify and position</h4>
<div class="outline-text-4" id="text-13-4-2">

<p>OBJECTIVES 2
</p><ul>
<li>systematic
</li>
<li>capable of describing the musical surface
</li>
<li>perceptual relevance
</li>
<li>how is it different to existing approaches?
</li>
<li>benefits?
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> Similarity Measures</h3>
<div class="outline-text-3" id="text-13-5">

<p>TOOL FOR REPRESENTATION
</p>
</div>

<div id="outline-container-13-5-1" class="outline-4">
<h4 id="sec-13-5-1"><span class="section-number-4">13.5.1</span> Introduction</h4>
<div class="outline-text-4" id="text-13-5-1">

<ul>
<li>What?
<ul>
<li>theoretical models of similarity
</li>
<li>many different models and approaches
</li>
<li>why are there so many models.
</li>
<li>what do they measure
</li>
</ul>

</li>
<li>Why?
<ul>
<li>EXPLAIN WHY SIMILARITY MEASURES ARE IMPORTANT IN GENERAL.
</li>
<li>visualisation
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-13-5-2" class="outline-4">
<h4 id="sec-13-5-2"><span class="section-number-4">13.5.2</span> Survey</h4>
<div class="outline-text-4" id="text-13-5-2">

<p>OBJECTIVE 3
</p><ul>
<li>surveyed how
</li>
<li>outcomes
</li>
</ul>

</div>

</div>

<div id="outline-container-13-5-3" class="outline-4">
<h4 id="sec-13-5-3"><span class="section-number-4">13.5.3</span> Total Measures</h4>
<div class="outline-text-4" id="text-13-5-3">

<ul>
<li>Subset vector based
</li>
<li>consider subsets of all sizes
</li>
<li>6 total measures
</li>
<li>example plot of chord comparisons
</li>
<li>general conclusions
</li>
<li>this will be used later
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-13-6" class="outline-3">
<h3 id="sec-13-6"><span class="section-number-3">13.6</span> Set Class Analysis</h3>
<div class="outline-text-3" id="text-13-6">

<ul>
<li>basic steps
<ul>
<li>Desrcibe/model
<ul>
<li>segment
</li>
<li>describe each segment with its SC
</li>
</ul>

</li>
<li>representation
<ul>
<li>find a appropriate representation of the data
</li>
<li>visualise
</li>
</ul>

</li>
</ul>

</li>
<li>not much previous work has been done
<ul>
<li>class scapes
</li>
</ul>

</li>
<li>segmentations is a crucial 
</li>
</ul>

</div>

</div>

<div id="outline-container-13-7" class="outline-3">
<h3 id="sec-13-7"><span class="section-number-3">13.7</span> Segmentation</h3>
<div class="outline-text-3" id="text-13-7">

<p>THIS IS THE MOST IMPORTANT STAGE
</p><ul>
<li>why is it important (timing/scale of oberservation)
<ul>
<li>the segment size determines the size of the sets
</li>
</ul>

</li>
<li>two segmentation policies to be used in conjunction
<ol>
<li>fully systematic segmentation
<ul>
<li>retrieve the entire sc contents of a piece
</li>
</ul>

</li>
<li>sliding window
<ul>
<li>for represntation stage
</li>
<li>tune in to sets of interest
</li>
</ul>

</li>
</ol>

</li>
</ul>


</div>

<div id="outline-container-13-7-1" class="outline-4">
<h4 id="sec-13-7-1"><span class="section-number-4">13.7.1</span> Systematic</h4>
<div class="outline-text-4" id="text-13-7-1">

<ul>
<li>how?
</li>
<li>class-scape
</li>
<li>class matrix
</li>
<li>class vector
</li>
<li>Example class matrix and class vector for bach prelude
</li>
<li>what do they show?
</li>
</ul>

</div>

</div>

<div id="outline-container-13-7-2" class="outline-4">
<h4 id="sec-13-7-2"><span class="section-number-4">13.7.2</span> Sliding Window</h4>
<div class="outline-text-4" id="text-13-7-2">

<ul>
<li>window and hop size selection
</li>
<li>what are the sets of interest?
</li>
<li>window and hop size can be informed by the previous plots
</li>
<li>Example: Average seg size for SCs and card
</li>
<li>choose 3 and 4 note chords
</li>
<li>Example: class vector with superimposed sliding window contents
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-13-8" class="outline-3">
<h3 id="sec-13-8"><span class="section-number-3">13.8</span> Representation</h3>
<div class="outline-text-3" id="text-13-8">


</div>

<div id="outline-container-13-8-1" class="outline-4">
<h4 id="sec-13-8-1"><span class="section-number-4">13.8.1</span> Distance Plot</h4>
<div class="outline-text-4" id="text-13-8-1">

<ul>
<li>what?
<ul>
<li>represents tonal change in time "with respect to specific sets"
</li>
</ul>

</li>
<li>how?
<ul>
<li>segmentation (window and hop size selection)
</li>
<li>comparison set selection
</li>
<li>what are the sets of interest and why?
</li>
</ul>

</li>
<li>peaks
</li>
<li>recurring patterns in the curve
</li>
</ul>

</div>

</div>
