finalpresentation.org
* Agustin Comments
- main differences between pc-set and other tonal descriptions, in the
  sense of the "benefits" with respect to other ways of describing
  tonality.

- The same about the similarity measures. Something (very general) has
  to be said in this respect from the very beginning, so as to
  motivate best the approach and catch the audience attention.

- Said differently, which are the limitations/shortcomings of other
  standard tonal descriptions and measures, that call for a different
  approach?

- problem to be approached rather than "a way of doing things", as
  well as a clear statement of your approach (in relation to other
  commonly used tonal descriptions)

- SC similarity measures:
  - why there are that many models (what they measure or attempt
    to measure).

- As for the term "similarity", I can't figure out what
  do you plan to explain (qualitative, perceptual, purely theoretical,
  analysis-related, ...). I think the similarity issue will trigger
  questions from the committee, as it is a hot topic in MIR.

- Maybe more than emphasizing the term "visualisation", I would use
  "representation". It is not actually necessary to "visualise" the
  resulting time series, for them to be informative. Some of them are
  actually used as input to other algorithms (e.g. SSM), and can be
  mined automatically without human intervention.

- Segmentation: I'm curious about what you plan to say about the
  segment length statistics. It is just a preliminar exploration or
  did you find some insights? I think some interesting stuff could be
  derived from this analysis.

- Visualisation: to me, the point here is to observe the tonal change
  in time "with respect to specific sets" (stress here), so I would
  maybe give stress to the "sets of interest" (and why they may be of
  interest). Which time-evolving musical (relevant) aspects are (or
  could be) evidenced?

- I like the visual sparsity of your slides (I would be even more
  sparse). In general, it is desirable to explain every concept
  directly with easy-to-understand examples, when possible, and to
  minimize the text and number of concepts in a single slide.

- Contributions of your work: 
  - Your SOA is not only comprehensive, but it is also a

  - deep and distilled review of the similarity measures
    - (sparse, not easy to find, not always properly documented,
      mostly used in non-analytical contexts, ...).
    - The organization of this information constitutes a nice
      contribution in itself.
    - Implementation of the measures in an easy-to-use way, which was
      something unavailable so far.
    - This brings tools, which were used only for
      specialists/theorists, closer to a broad community and to a
      range of potential applications.

  - The quantitative comparison between them for common sets (chords,
    scales). Did you conclude some general/clear discriminatory power
    among the measures, that it is worth mentioning?

- The application context: structure / pattern recognition. You should
  also state at the end

- what has not been done yet, in the context of the thesis. Are your
  results just exploratory/preliminary? Do the results point to some
  specific analysis target, to be addressed during the summer?

- Some questions that may arise from the thesis' committee:
  - How are your results comparable to existing analyses of Bach's WTC?
    (In any case, it is desirable to overlap some manual annotation
    showing the relevance/limitations of your plots, so as to be
    self-informative).
  - Is your approach saying something new/better about the piece, or is
    it just confirming what other approaches already do? If they just
    confirm existing knowledge, what is the (not yet exploited)
    potential? (e.g. using different comparison sets may reveal
    different musical aspects, which ones, ...).
  - Are the measures "better" than, let's say, Euclidian or correlation
    distances? In which respect?
  - The term "evaluation" in your title is maybe the strongest word,
    which may probably trigger questions from the committee. Do you plan
    to evaluate this with respect to some baseline/ground-truth?
    (e.g. structure segmentation tasks in MIREX). In general, I would
    try to reinforce and clarify "what" has been (or will be) evaluated,
    throughout your presentation.


* Presentation Script
** Title slide
- name, title, supervisor
** outline
- introduction
- methodology
- representation
- conclusions
- future work
** Introduxtion - Definitions
- first i want to do a quick clarification of the some of terms in the
  title as a preface the problem and objectives.
- firstly, tonal analysis:
  - used to here as a general term for any computational activities
    involving tonality. MIR etc
  - and it encompasses 2 stages
    - description: describing the tonal content.
    - representation: represent the content in a meaningful way.
- the other terms...
- set class theoy: a tool for description stage
- similarity measures: a tool fot the representation stage
- all these things will be gone into further later on
** Problem
- the problem has 2 parts
- firstly: existing approaches to tonal analysis lack depth
  - for example: the predominant use of template plate matching for
    chord and key recognition limit many systems to discrete
    boundaries.
  - when in fact fact tonality is a very fluid concept.
  - these approaches are ofter limited to the major-minor paradigm.
  - which is often an insufficient explanation of tonality even for
    some western music.
- the second part of the problem is use of non musical similarity
  measures
  - such as correlation or euclidean distance
  - using these purely mathematical measures seems counterintuituive
    in some cases as they most likely lack musical or perceptual
    relevance
