finalpresentation.html

<div id="outline-container-13-8-2" class="outline-4">
<h4 id="sec-13-8-2"><span class="section-number-4">13.8.2</span> autocorrelation</h4>
<div class="outline-text-4" id="text-13-8-2">

<ul>
<li>autocorrelate distance plot
</li>
<li>peaks
</li>
<li>reveals structure
</li>
<li>example plot
</li>
</ul>

</div>

</div>

<div id="outline-container-13-8-3" class="outline-4">
<h4 id="sec-13-8-3"><span class="section-number-4">13.8.3</span> Self-similarity matrix</h4>
<div class="outline-text-4" id="text-13-8-3">

<ul>
<li>no comparison set
</li>
<li>systematically compare all segments
</li>
<li>reveals structure
</li>
<li>example plot
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-13-9" class="outline-3">
<h3 id="sec-13-9"><span class="section-number-3">13.9</span> Analysis Tool</h3>
<div class="outline-text-3" id="text-13-9">

<ul>
<li>many parameters
</li>
<li>exploratory tool
</li>
<li>demonstration
<ul>
<li>cadential sets
</li>
<li>diatonic set
</li>
<li>chromatic sets
</li>
<li>8-23
</li>
<li>different measures
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-13-10" class="outline-3">
<h3 id="sec-13-10"><span class="section-number-3">13.10</span> Conclusions</h3>
<div class="outline-text-3" id="text-13-10">

<ul>
<li>systematic mid-level descriptions are a starting point for many
  applications
</li>
<li>pc set theory
</li>
<li>similarity measures
</li>
<li>visualisation techniques
</li>
<li>analysis tool
</li>
</ul>

</div>

</div>

<div id="outline-container-13-11" class="outline-3">
<h3 id="sec-13-11"><span class="section-number-3">13.11</span> Future work</h3>
<div class="outline-text-3" id="text-13-11">

<ul>
<li>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Agustin Comments</h2>
<div class="outline-text-2" id="text-14">

<ul>
<li>main differences between pc-set and other tonal descriptions, in the
  sense of the "benefits" with respect to other ways of describing
  tonality.

</li>
<li>The same about the similarity measures. Something (very general) has
  to be said in this respect from the very beginning, so as to
  motivate best the approach and catch the audience attention.

</li>
<li>Said differently, which are the limitations/shortcomings of other
  standard tonal descriptions and measures, that call for a different
  approach?

</li>
<li>problem to be approached rather than "a way of doing things", as
  well as a clear statement of your approach (in relation to other
  commonly used tonal descriptions)

</li>
<li>SC similarity measures:
<ul>
<li>why there are that many models (what they measure or attempt
    to measure).

</li>
</ul>

</li>
<li>As for the term "similarity", I can't figure out what
  do you plan to explain (qualitative, perceptual, purely theoretical,
  analysis-related, &hellip;). I think the similarity issue will trigger
  questions from the committee, as it is a hot topic in MIR.

</li>
<li>Maybe more than emphasizing the term "visualisation", I would use
  "representation". It is not actually necessary to "visualise" the
  resulting time series, for them to be informative. Some of them are
  actually used as input to other algorithms (e.g. SSM), and can be
  mined automatically without human intervention.

</li>
<li>Segmentation: I'm curious about what you plan to say about the
  segment length statistics. It is just a preliminar exploration or
  did you find some insights? I think some interesting stuff could be
  derived from this analysis.

</li>
<li>Visualisation: to me, the point here is to observe the tonal change
  in time "with respect to specific sets" (stress here), so I would
  maybe give stress to the "sets of interest" (and why they may be of
  interest). Which time-evolving musical (relevant) aspects are (or
  could be) evidenced?

</li>
<li>I like the visual sparsity of your slides (I would be even more
  sparse). In general, it is desirable to explain every concept
  directly with easy-to-understand examples, when possible, and to
  minimize the text and number of concepts in a single slide.

</li>
<li>Contributions of your work: 
<ul>
<li>Your SOA is not only comprehensive, but it is also a

</li>
<li>deep and distilled review of the similarity measures
<ul>
<li>(sparse, not easy to find, not always properly documented,
      mostly used in non-analytical contexts, &hellip;).
</li>
<li>The organization of this information constitutes a nice
      contribution in itself.
</li>
<li>Implementation of the measures in an easy-to-use way, which was
      something unavailable so far.
</li>
<li>This brings tools, which were used only for
      specialists/theorists, closer to a broad community and to a
      range of potential applications.

</li>
</ul>

</li>
<li>The quantitative comparison between them for common sets (chords,
    scales). Did you conclude some general/clear discriminatory power
    among the measures, that it is worth mentioning?

</li>
</ul>

</li>
<li>The application context: structure / pattern recognition. You should
  also state at the end

</li>
<li>what has not been done yet, in the context of the thesis. Are your
  results just exploratory/preliminary? Do the results point to some
  specific analysis target, to be addressed during the summer?

</li>
<li>Some questions that may arise from the thesis' committee:
<ul>
<li>How are your results comparable to existing analyses of Bach's WTC?
    (In any case, it is desirable to overlap some manual annotation
    showing the relevance/limitations of your plots, so as to be
    self-informative).
</li>
<li>Is your approach saying something new/better about the piece, or is
    it just confirming what other approaches already do? If they just
    confirm existing knowledge, what is the (not yet exploited)
    potential? (e.g. using different comparison sets may reveal
    different musical aspects, which ones, &hellip;).
</li>
<li>Are the measures "better" than, let's say, Euclidian or correlation
    distances? In which respect?
</li>
<li>The term "evaluation" in your title is maybe the strongest word,
    which may probably trigger questions from the committee. Do you plan
    to evaluate this with respect to some baseline/ground-truth?
    (e.g. structure segmentation tasks in MIREX). In general, I would
    try to reinforce and clarify "what" has been (or will be) evaluated,
    throughout your presentation.
</li>
</ul>

</li>
</ul>



</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Presentation Script</h2>
<div class="outline-text-2" id="text-15">


</div>

<div id="outline-container-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> Title slide</h3>
<div class="outline-text-3" id="text-15-1">

<ul>
<li>name, title, supervisor
</li>
</ul>

</div>

</div>

<div id="outline-container-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> outline</h3>
<div class="outline-text-3" id="text-15-2">

<ul>
<li>introduction
</li>
<li>methodology
</li>
<li>representation
</li>
<li>conclusions
</li>
<li>future work
</li>
</ul>

</div>

</div>

<div id="outline-container-15-3" class="outline-3">
<h3 id="sec-15-3"><span class="section-number-3">15.3</span> Introduxtion - Definitions</h3>
<div class="outline-text-3" id="text-15-3">

<ul>
<li>first i want to do a quick clarification of the some of terms in the
  title as a preface the problem and objectives.
</li>
<li>firstly, tonal analysis:
<ul>
<li>used to here as a general term for any computational activities
    involving tonality. MIR etc
</li>
<li>and it encompasses 2 stages
<ul>
<li>description: describing the tonal content.
</li>
<li>representation: represent the content in a meaningful way.
</li>
</ul>

</li>
</ul>

</li>
<li>the other terms&hellip;
</li>
<li>set class theoy: a tool for description stage
</li>
<li>similarity measures: a tool fot the representation stage
</li>
<li>all these things will be gone into further later on
</li>
</ul>

</div>

</div>

<div id="outline-container-15-4" class="outline-3">
<h3 id="sec-15-4"><span class="section-number-3">15.4</span> Problem</h3>
<div class="outline-text-3" id="text-15-4">

<ul>
<li>the problem has 2 parts
</li>
<li>firstly: existing approaches to tonal analysis lack depth
<ul>
<li>for example: the predominant use of template plate matching for
    chord and key recognition limit many systems to discrete
    boundaries.
</li>
<li>when in fact fact tonality is a very fluid concept.
</li>
<li>these approaches are ofter limited to the major-minor paradigm.
</li>
<li>which is often an insufficient explanation of tonality even for
    some western music.
</li>
</ul>

</li>
<li>the second part of the problem is use of non musical similarity
  measures
<ul>
<li>such as correlation or euclidean distance
</li>
<li>using these purely mathematical measures seems counterintuituive
    in some cases as they most likely lack musical or perceptual
    relevance
</li>
</ul>

</li>
</ul>

</div>

</div>
