finalpresentation.org
** Objectives
- so, with those problems in mind, my objectives are as follows:
  1. To adopt a systematic approach to description of tonality.
  2. Use set class theoy
     - but not just to use it. i also want to 
     - justify its use as a systematic descriptive tool, capable of
       relating useful musical information as well as having a degree
       of perceptual relevance.
     - To position set class analysis among existing methods of tonal
       description such as chroma vector time-series.
  3. To create a comprehensive and practical survey of set class
     similarity measures.
     - To examine the measures in terms of systematicity and
       perceptual relevance.
  4. To develop techniques for the representation of set class
     description so as to expose useful musical information.
     - To utilise set class similarity in these representation.
  5. To demonstrate the utility of these techniques through specific
     analysis examples.
** Systematic Description
- here address objective 1: explain the fundamental basis of my
  apporach.
- so what does it mean to be systematic?
- the objective here is to not limit the description by basing it on
  high level concepts such as chord and key.
- but rather base it on mid-level concepts such as notes.
- by systematically detailing the position of every note you produce a
  description that is independent of high level concepts but none the
  less capable of capturing them.
- this kind of description is sometimes referred to as the musical
  surface.
- So that is the fundamental aim here in terms of description. its
  being sytematic.
** Set Class Theory - What?
- so now set class theory
- as i said before, it is a descriptive tool
- and before i go on to address onjective 2 i will briefly explain the
  basic principles for those who might be unfamiliar.
- the basic idea is pitches as numbers
- and the use of equivelance relations to reduce the amound of data
  required to describe.
- so first this is a pitch set with four members corresponding to an A
  mjor chord.
- the concept of set means that we dont care about the order of the
  members or whether the occur simulaneously or in sequence. and we
  inore repetitions.
- underneath there are the correpondning midi note numbers.
- so a pitch class is the residue class modulo 12 of the pitch numbers
  which are as follows.
- and of course as we ignore repetitions in a set the pitch class set
  is as follows.
- then you have a set class which is a way of grouping pitch class
  sets.
- for example all pitch class sets that are transpostions of each
  other belong to the same set class.
- the prime form of a set class is merely a convention for referring
  to the class by arranging the entries so that they start on 0 and
  are most tightly packed to the left.
- in addition theres another convention for ordering and naming the
  set classes called forte name after the guy who devised it. like so.
- this just means this is the 11th set class of cardinality 3 or
  size 3.
- so those are the basics...
** Set Class Theory - Why?
- now ill try and address objective 2. why use set class theory.
- well, it fits the mid-level critera i spoke of earlier as any
  collection of pitches can be described by its set class regardless
  of whether they have a specific harmonic role.
- it coalesces fairly tightly with perception.
  - by this i mean the fundamental principles i.e.:
    - octave equivelance
    - division of the octave into equivelance classes
    - and transpositional equivelance
  - have been shown to have a solid basis in perception.
- so interms of benefits and differences,
- well, as ive mentioned it constitues a substantial reduction of
  information but whilst presuming to still be systematic and
  perceptually relevant.
- the crucial difference between this type of description and other
  based on say chroma is that the relationships are all relative.
- by which i mean it is not capable of capturing the absolute note or
  chord labels. only the type.
- so thats set class theory...
** Similarity Measures - What?
- now: set class similarity measures:
- first, what are they?
  - well since the development of set class theory, many theorists
    have developed theoretical models that attempt to quantify which
    how similarity or distance detween two set classes.
  - there are countless different models that start from a wide range
    of theoretical or musical principles.
- so how exactly do they work?
  - well in this project i have limited by examination to a specific
    type of measure
  - which compare the subsets of set classes.
  - so a subset is smaller set class which can be embedded in a larger
    on.
  - and for a given set you can count all the instances of a smaller
    set classes which can be embedded in it and represent that
    information as a vector.
  - so these measures generally consist of a technique for comparing
    these subset vecotrs.
- so why use these measures?
  - well this goes back to the second part of the problem.
  - these measure are musically relevant
  - and potentially perceptually relevant.
  - although the perceptual relevance of these measures has only been
    investigated somehwta sporadically and inconclusively
  - they have none the less be formed with musical intuition in mind.
** Similarity Measures - Survey
- so this brings us to objective 3:
- a survey of the measures which as i mentioned are numerous.
- so i surveyed 25+ different measures.
- then categorised them in terms of two things.
  - firstly, how systematic their approach. in terms of what ive
    already explained.
  - and secondly, their perceptual relevance.
- the outcome of this survey was the selection of 6 differnt measures
  from 4 theorists.
- these are their cryptic names
- they all have a different fundamental approach.
** Similarity Measures - survey 2
- the second party of the survey was to examine the specific
  capabilities of each.
- by this i mean the descriminatory power.
- so here it useful to visualise some of the values.
- this plot shows:
  - the values produced for comparisons involving common tonal objects
    such as chords and scales.
  - the x and y axis show the set class corresponding to
  - and each square is coloured accoridng to the distance between
    them.
- from visualisations like this it was possible to draw some basic
  conclusions about the differences between the measures.
- but these difference i will discuss later in the context of
  representation.
