finalpresentation.html

<div id="outline-container-15-5" class="outline-3">
<h3 id="sec-15-5"><span class="section-number-3">15.5</span> Objectives</h3>
<div class="outline-text-3" id="text-15-5">

<ul>
<li>so, with those problems in mind, my objectives are as follows:
<ol>
<li>To adopt a systematic approach to description of tonality.
</li>
<li>Use set class theoy
<ul>
<li>but not just to use it. i also want to 
</li>
<li>justify its use as a systematic descriptive tool, capable of
       relating useful musical information as well as having a degree
       of perceptual relevance.
</li>
<li>To position set class analysis among existing methods of tonal
       description such as chroma vector time-series.
</li>
</ul>

</li>
<li>To create a comprehensive and practical survey of set class
     similarity measures.
<ul>
<li>To examine the measures in terms of systematicity and
       perceptual relevance.
</li>
</ul>

</li>
<li>To develop techniques for the representation of set class
     description so as to expose useful musical information.
<ul>
<li>To utilise set class similarity in these representation.
</li>
</ul>

</li>
<li>To demonstrate the utility of these techniques through specific
     analysis examples.
</li>
</ol>

</li>
</ul>

</div>

</div>

<div id="outline-container-15-6" class="outline-3">
<h3 id="sec-15-6"><span class="section-number-3">15.6</span> Systematic Description</h3>
<div class="outline-text-3" id="text-15-6">

<ul>
<li>here address objective 1: explain the fundamental basis of my
  apporach.
</li>
<li>so what does it mean to be systematic?
</li>
<li>the objective here is to not limit the description by basing it on
  high level concepts such as chord and key.
</li>
<li>but rather base it on mid-level concepts such as notes.
</li>
<li>by systematically detailing the position of every note you produce a
  description that is independent of high level concepts but none the
  less capable of capturing them.
</li>
<li>this kind of description is sometimes referred to as the musical
  surface.
</li>
<li>So that is the fundamental aim here in terms of description. its
  being sytematic.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-7" class="outline-3">
<h3 id="sec-15-7"><span class="section-number-3">15.7</span> Set Class Theory - What?</h3>
<div class="outline-text-3" id="text-15-7">

<ul>
<li>so now set class theory
</li>
<li>as i said before, it is a descriptive tool
</li>
<li>and before i go on to address onjective 2 i will briefly explain the
  basic principles for those who might be unfamiliar.
</li>
<li>the basic idea is pitches as numbers
</li>
<li>and the use of equivelance relations to reduce the amound of data
  required to describe.
</li>
<li>so first this is a pitch set with four members corresponding to an A
  mjor chord.
</li>
<li>the concept of set means that we dont care about the order of the
  members or whether the occur simulaneously or in sequence. and we
  inore repetitions.
</li>
<li>underneath there are the correpondning midi note numbers.
</li>
<li>so a pitch class is the residue class modulo 12 of the pitch numbers
  which are as follows.
</li>
<li>and of course as we ignore repetitions in a set the pitch class set
  is as follows.
</li>
<li>then you have a set class which is a way of grouping pitch class
  sets.
</li>
<li>for example all pitch class sets that are transpostions of each
  other belong to the same set class.
</li>
<li>the prime form of a set class is merely a convention for referring
  to the class by arranging the entries so that they start on 0 and
  are most tightly packed to the left.
</li>
<li>in addition theres another convention for ordering and naming the
  set classes called forte name after the guy who devised it. like so.
</li>
<li>this just means this is the 11th set class of cardinality 3 or
  size 3.
</li>
<li>so those are the basics&hellip;
</li>
</ul>

</div>

</div>

<div id="outline-container-15-8" class="outline-3">
<h3 id="sec-15-8"><span class="section-number-3">15.8</span> Set Class Theory - Why?</h3>
<div class="outline-text-3" id="text-15-8">

<ul>
<li>now ill try and address objective 2. why use set class theory.
</li>
<li>well, it fits the mid-level critera i spoke of earlier as any
  collection of pitches can be described by its set class regardless
  of whether they have a specific harmonic role.
</li>
<li>it coalesces fairly tightly with perception.
<ul>
<li>by this i mean the fundamental principles i.e.:
<ul>
<li>octave equivelance
</li>
<li>division of the octave into equivelance classes
</li>
<li>and transpositional equivelance
</li>
</ul>

</li>
<li>have been shown to have a solid basis in perception.
</li>
</ul>

</li>
<li>so interms of benefits and differences,
</li>
<li>well, as ive mentioned it constitues a substantial reduction of
  information but whilst presuming to still be systematic and
  perceptually relevant.
</li>
<li>the crucial difference between this type of description and other
  based on say chroma is that the relationships are all relative.
</li>
<li>by which i mean it is not capable of capturing the absolute note or
  chord labels. only the type.
</li>
<li>so thats set class theory&hellip;
</li>
</ul>

</div>

</div>

<div id="outline-container-15-9" class="outline-3">
<h3 id="sec-15-9"><span class="section-number-3">15.9</span> Similarity Measures - What?</h3>
<div class="outline-text-3" id="text-15-9">

<ul>
<li>now: set class similarity measures:
</li>
<li>first, what are they?
<ul>
<li>well since the development of set class theory, many theorists
    have developed theoretical models that attempt to quantify which
    how similarity or distance detween two set classes.
</li>
<li>there are countless different models that start from a wide range
    of theoretical or musical principles.
</li>
</ul>

</li>
<li>so how exactly do they work?
<ul>
<li>well in this project i have limited by examination to a specific
    type of measure
</li>
<li>which compare the subsets of set classes.
</li>
<li>so a subset is smaller set class which can be embedded in a larger
    on.
</li>
<li>and for a given set you can count all the instances of a smaller
    set classes which can be embedded in it and represent that
    information as a vector.
</li>
<li>so these measures generally consist of a technique for comparing
    these subset vecotrs.
</li>
</ul>

</li>
<li>so why use these measures?
<ul>
<li>well this goes back to the second part of the problem.
</li>
<li>these measure are musically relevant
</li>
<li>and potentially perceptually relevant.
</li>
<li>although the perceptual relevance of these measures has only been
    investigated somehwta sporadically and inconclusively
</li>
<li>they have none the less be formed with musical intuition in mind.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-15-10" class="outline-3">
<h3 id="sec-15-10"><span class="section-number-3">15.10</span> Similarity Measures - Survey</h3>
<div class="outline-text-3" id="text-15-10">

<ul>
<li>so this brings us to objective 3:
</li>
<li>a survey of the measures which as i mentioned are numerous.
</li>
<li>so i surveyed 25+ different measures.
</li>
<li>then categorised them in terms of two things.
<ul>
<li>firstly, how systematic their approach. in terms of what ive
    already explained.
</li>
<li>and secondly, their perceptual relevance.
</li>
</ul>

</li>
<li>the outcome of this survey was the selection of 6 differnt measures
  from 4 theorists.
</li>
<li>these are their cryptic names
</li>
<li>they all have a different fundamental approach.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-11" class="outline-3">
<h3 id="sec-15-11"><span class="section-number-3">15.11</span> Similarity Measures - survey 2</h3>
<div class="outline-text-3" id="text-15-11">

<ul>
<li>the second party of the survey was to examine the specific
  capabilities of each.
</li>
<li>by this i mean the descriminatory power.
</li>
<li>so here it useful to visualise some of the values.
</li>
<li>this plot shows:
<ul>
<li>the values produced for comparisons involving common tonal objects
    such as chords and scales.
</li>
<li>the x and y axis show the set class corresponding to
</li>
<li>and each square is coloured accoridng to the distance between
    them.
</li>
</ul>

</li>
<li>from visualisations like this it was possible to draw some basic
  conclusions about the differences between the measures.
</li>
<li>but these difference i will discuss later in the context of
  representation.
</li>
</ul>

</div>

</div>
