finalpresentation.org
** Segmentation
- so now the final part of my methodology is segmentation
- which is a really crucial stage.
- because the scale of observation has a huge effect on what can be
  observed.
- so my approach uses two segementation policies that work in
  conjunction.
  - first a fully systematic method
    - which contains the entire SC contents of piece
  - second a sliding window
    - with fixed window and hop size
    - and this is for tuning into certain sets of interest
  - ill talk about what i mean by sets of interest a bit later.
  - the reason for the two methods is that selecting the size of the
    sliding window can be based on information from the systematic
    segmentation.
** Systematic Segmentation
- so to explain the function of the each of the segmentation methods
  ill use an example.
- its this piece which some people may know.
- and so the we apply the systematic segmentation method to this
- and it exhaustively finds every change in pitch material
- segmenting the piece in every possible way.
- the resulting data structure can be thought of a 3-dimensional
  binary matrix.
- with axes representing time, time-scale (segment length) and set
  class.
** Class Matrix and vector
- an intermediate representation can be used to view some global
  information about the sc contents of the piece.
- this is called class vector.
  - it shows the total time that each set class is present as a
    proportion of the total length.
  - this gives quite a compact picture of the overall set class
    contents of the piece.
  - these three largest bars correspond to
    - major triads
    - the authentic cadence
    - and the diatonic set
  - so that tells you something about the general sonority of the
    music.
** Sliding Window
- now, the sliding window is used tune in or focus on the specific set
  classes that youre interested in.
- obviously you have to select the right window and hopsize and these
  will depend on the sets you want to observe.
- so its possible to use data from the systematic segmentation to
  inform choices about the sliding window parameters.
** Sliding window card avg
- this plot shows:
- for each cardinality the average length of the segments in which
  they appear.
- and the standard deviation.
- so if we wanted to capture 3 and 4 note chords for example we can
  see that they appear in segments of mainly between 1 and 2 beats.
** Sliding window sc avg
- alternatively we can view the same information but for each separate
  setclass.
- for example we want to capture major triads which we can see appear
  mainly in segment of around 2 beats.
** Sliding window class vec + slding content
- so if we apply a sliding window with window size 2 beats and hop
  size 1 beat...
- we can view the contents of the sliding window description in
  relation to the class vector which i explained earlier.
- as you can see we've managed to capture a large number of major
  triads
- as well as...
** Representation
- so those are the two segmentation methods, and how they can be used
  together.
- now i will explain 3 techniques that utilise sc similarity measures
  to represent the sc data from these descriptions.
  - they are distance plot
  - autocorrelation
  - and self similarity matrix
** Distance Plot
- so, distance plot:
- the basic idea of the distance plot is to represent tonal change
  in time with respect to a comparison set.
- There are three interdependent parameters which must be selected
  according to your spcific intentions:
  - Segmentation (window and hop size),
  - comparison set
  - and similarity/distance measure.
- The segmentation determines the captured SC content which should be
  targeted according to its relationship to the comparison set. This
  relationship is determined by the measure used which must possess an
  adequate degree of discrimination so as to produce noticeable
  changes in the time series.
- so here we have the distance plot calculated using the sliding
  window segmentation described before,
- a comparison set 3-11B the major triad
- and the atmemb distance.
- as we know that this window captures a high proportion of major
  triads from the previous section,
- it is unsurprising to see the distance plot dropping to zero where
  the segment coincides with the comparison set.
- the points where it rises higher correspond to departures from
  familiar major chords.
- actually we can already see a kind of pattern:
  - the major triad seems to appear at fairly regular intervals.
- this is where the next representation technique come in...
** Autocorrelation
- most people are familiar with autocorrelation im sure.
- so, this is the autocorrelation of the distance plot we just saw.
- as you can see there are peaks at regular intervals two bar
  intervals.
- the highest being at four bars.
- this would seem to indicate that some aspect of the music is
  repeating at regular 2 intervals.
- and that probably makes sense. most music is strucutered somehow in
  even groups like this.
** Self-Similarity Matrix
- finally, the self-similarity matrix,
- which again im sure most people are familiar with.
- this despenses with the comparison set
- and instead compares each segment to every other segment.
- this is a good way of finding repetitions in any time-series.
- so this is the ssm for the sliding window that we've been using.
- theres the familair diagonal down the middle.
- but the there are a few other features visible.
- most notable is the diagonal ive highlighted. 
- and this corresponds to the repetition of bars 7-11 in bars 15-19
  but with a transposition.
- so those are the three techniques.
** Analysis Tool
- finally
- Due to the complex relationship between the different parameters
  involved in this kind of analysis, it is desirable to work in an
  interactive and exploratory environment.
- The analysis tool combines all of the presented representation
  techniques in a single Matlab GUI.
- This kind of tool provides a test bench for exploring the
  capabilities of these techniques and an environment for conducting
  preliminary experiments.
- this is screen shot shows is of the example that i have just
  explained.
