finalpresentation.html

<div id="outline-container-15-12" class="outline-3">
<h3 id="sec-15-12"><span class="section-number-3">15.12</span> Segmentation</h3>
<div class="outline-text-3" id="text-15-12">

<ul>
<li>so now the final part of my methodology is segmentation
</li>
<li>which is a really crucial stage.
</li>
<li>because the scale of observation has a huge effect on what can be
  observed.
</li>
<li>so my approach uses two segementation policies that work in
  conjunction.
<ul>
<li>first a fully systematic method
<ul>
<li>which contains the entire SC contents of piece
</li>
</ul>

</li>
<li>second a sliding window
<ul>
<li>with fixed window and hop size
</li>
<li>and this is for tuning into certain sets of interest
</li>
</ul>

</li>
<li>ill talk about what i mean by sets of interest a bit later.
</li>
<li>the reason for the two methods is that selecting the size of the
    sliding window can be based on information from the systematic
    segmentation.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-15-13" class="outline-3">
<h3 id="sec-15-13"><span class="section-number-3">15.13</span> Systematic Segmentation</h3>
<div class="outline-text-3" id="text-15-13">

<ul>
<li>so to explain the function of the each of the segmentation methods
  ill use an example.
</li>
<li>its this piece which some people may know.
</li>
<li>and so the we apply the systematic segmentation method to this
</li>
<li>and it exhaustively finds every change in pitch material
</li>
<li>segmenting the piece in every possible way.
</li>
<li>the resulting data structure can be thought of a 3-dimensional
  binary matrix.
</li>
<li>with axes representing time, time-scale (segment length) and set
  class.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-14" class="outline-3">
<h3 id="sec-15-14"><span class="section-number-3">15.14</span> Class Matrix and vector</h3>
<div class="outline-text-3" id="text-15-14">

<ul>
<li>an intermediate representation can be used to view some global
  information about the sc contents of the piece.
</li>
<li>this is called class vector.
<ul>
<li>it shows the total time that each set class is present as a
    proportion of the total length.
</li>
<li>this gives quite a compact picture of the overall set class
    contents of the piece.
</li>
<li>these three largest bars correspond to
<ul>
<li>major triads
</li>
<li>the authentic cadence
</li>
<li>and the diatonic set
</li>
</ul>

</li>
<li>so that tells you something about the general sonority of the
    music.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-15-15" class="outline-3">
<h3 id="sec-15-15"><span class="section-number-3">15.15</span> Sliding Window</h3>
<div class="outline-text-3" id="text-15-15">

<ul>
<li>now, the sliding window is used tune in or focus on the specific set
  classes that youre interested in.
</li>
<li>obviously you have to select the right window and hopsize and these
  will depend on the sets you want to observe.
</li>
<li>so its possible to use data from the systematic segmentation to
  inform choices about the sliding window parameters.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-16" class="outline-3">
<h3 id="sec-15-16"><span class="section-number-3">15.16</span> Sliding window card avg</h3>
<div class="outline-text-3" id="text-15-16">

<ul>
<li>this plot shows:
</li>
<li>for each cardinality the average length of the segments in which
  they appear.
</li>
<li>and the standard deviation.
</li>
<li>so if we wanted to capture 3 and 4 note chords for example we can
  see that they appear in segments of mainly between 1 and 2 beats.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-17" class="outline-3">
<h3 id="sec-15-17"><span class="section-number-3">15.17</span> Sliding window sc avg</h3>
<div class="outline-text-3" id="text-15-17">

<ul>
<li>alternatively we can view the same information but for each separate
  setclass.
</li>
<li>for example we want to capture major triads which we can see appear
  mainly in segment of around 2 beats.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-18" class="outline-3">
<h3 id="sec-15-18"><span class="section-number-3">15.18</span> Sliding window class vec + slding content</h3>
<div class="outline-text-3" id="text-15-18">

<ul>
<li>so if we apply a sliding window with window size 2 beats and hop
  size 1 beat&hellip;
</li>
<li>we can view the contents of the sliding window description in
  relation to the class vector which i explained earlier.
</li>
<li>as you can see we've managed to capture a large number of major
  triads
</li>
<li>as well as&hellip;
</li>
</ul>

</div>

</div>

<div id="outline-container-15-19" class="outline-3">
<h3 id="sec-15-19"><span class="section-number-3">15.19</span> Representation</h3>
<div class="outline-text-3" id="text-15-19">

<ul>
<li>so those are the two segmentation methods, and how they can be used
  together.
</li>
<li>now i will explain 3 techniques that utilise sc similarity measures
  to represent the sc data from these descriptions.
<ul>
<li>they are distance plot
</li>
<li>autocorrelation
</li>
<li>and self similarity matrix
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-15-20" class="outline-3">
<h3 id="sec-15-20"><span class="section-number-3">15.20</span> Distance Plot</h3>
<div class="outline-text-3" id="text-15-20">

<ul>
<li>so, distance plot:
</li>
<li>the basic idea of the distance plot is to represent tonal change
  in time with respect to a comparison set.
</li>
<li>There are three interdependent parameters which must be selected
  according to your spcific intentions:
<ul>
<li>Segmentation (window and hop size),
</li>
<li>comparison set
</li>
<li>and similarity/distance measure.
</li>
</ul>

</li>
<li>The segmentation determines the captured SC content which should be
  targeted according to its relationship to the comparison set. This
  relationship is determined by the measure used which must possess an
  adequate degree of discrimination so as to produce noticeable
  changes in the time series.
</li>
<li>so here we have the distance plot calculated using the sliding
  window segmentation described before,
</li>
<li>a comparison set 3-11B the major triad
</li>
<li>and the atmemb distance.
</li>
<li>as we know that this window captures a high proportion of major
  triads from the previous section,
</li>
<li>it is unsurprising to see the distance plot dropping to zero where
  the segment coincides with the comparison set.
</li>
<li>the points where it rises higher correspond to departures from
  familiar major chords.
</li>
<li>actually we can already see a kind of pattern:
<ul>
<li>the major triad seems to appear at fairly regular intervals.
</li>
</ul>

</li>
<li>this is where the next representation technique come in&hellip;
</li>
</ul>

</div>

</div>

<div id="outline-container-15-21" class="outline-3">
<h3 id="sec-15-21"><span class="section-number-3">15.21</span> Autocorrelation</h3>
<div class="outline-text-3" id="text-15-21">

<ul>
<li>most people are familiar with autocorrelation im sure.
</li>
<li>so, this is the autocorrelation of the distance plot we just saw.
</li>
<li>as you can see there are peaks at regular intervals two bar
  intervals.
</li>
<li>the highest being at four bars.
</li>
<li>this would seem to indicate that some aspect of the music is
  repeating at regular 2 intervals.
</li>
<li>and that probably makes sense. most music is strucutered somehow in
  even groups like this.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-22" class="outline-3">
<h3 id="sec-15-22"><span class="section-number-3">15.22</span> Self-Similarity Matrix</h3>
<div class="outline-text-3" id="text-15-22">

<ul>
<li>finally, the self-similarity matrix,
</li>
<li>which again im sure most people are familiar with.
</li>
<li>this despenses with the comparison set
</li>
<li>and instead compares each segment to every other segment.
</li>
<li>this is a good way of finding repetitions in any time-series.
</li>
<li>so this is the ssm for the sliding window that we've been using.
</li>
<li>theres the familair diagonal down the middle.
</li>
<li>but the there are a few other features visible.
</li>
<li>most notable is the diagonal ive highlighted. 
</li>
<li>and this corresponds to the repetition of bars 7-11 in bars 15-19
  but with a transposition.
</li>
<li>so those are the three techniques.
</li>
</ul>

</div>

</div>

<div id="outline-container-15-23" class="outline-3">
<h3 id="sec-15-23"><span class="section-number-3">15.23</span> Analysis Tool</h3>
<div class="outline-text-3" id="text-15-23">

<ul>
<li>finally
</li>
<li>Due to the complex relationship between the different parameters
  involved in this kind of analysis, it is desirable to work in an
  interactive and exploratory environment.
</li>
<li>The analysis tool combines all of the presented representation
  techniques in a single Matlab GUI.
</li>
<li>This kind of tool provides a test bench for exploring the
  capabilities of these techniques and an environment for conducting
  preliminary experiments.
</li>
<li>this is screen shot shows is of the example that i have just
  explained.
</li>
</ul>

</div>

</div>
