finalpresentation.org
** Conclusions
- approach:
- that is, objectives 1 and 2,
- this work has demonstrated the capability of systematic set class
  descritpions to convey useful musical information.
- analysis outcomes: so objectives 4 and 5.
- the experiments ive done have constituted a preliminary examination
  of the complex relationship between the various parameters.
- they have also revealed that the 
** Future Work
- 



* Presentation Script again
** Outline
- this is the outline of my presentation
- first and introduction:
  - where i outline the problem and objectives
- then my methodology in which i address each of the objectives
- and finally conclusions and future work
** Introduction
*** Problem
1. existing approaches to tonal analysis lack depth.
   - the predominant use of template matching for chord and key
     estimation gives systems a narrow view of tonality and restricts
     them in many cases to the major-minor paradigm, which is arguably
     insufficient for even some western music.
2. the use of non-musical similarity measures
   - such as correlation and euclidean distance.
   - the use of these purely mathematical measures seems inappropriate
     when considering musical objects.
*** Definitions
- now i want to just give a quick clarification of some terms from the
  title as a preface to the objectives.
  - tonal analysis
  - Set class theory
  - similarity measures
*** Objectives
1. adopt a systematic approach to description
2. use set class theory
   - justify
   - position
3. survey similarity measures
4. develop techniques for the representation of set class data
   utilising these similarity measures.
5. demonstrate the capabilities of the method through specific
   analysis examples.
** Methodology
*** Systematic description
- this addresses objective 1
- and explains the fundamental basis to my approach.
- what does it mean to be systematic.
- the key here, is not base the description on high level concepts
  such as chord and key, which is restrictive.
- instead base it on mid-level concepts such as notes.
- systematic mid-level descriptions based on notes can be
  fundamentally independent of high level concepts but at the same
  time capable of capturing them.
- so the two importent terms here are systematic and midlevel.
*** Set class theory - what?
- as i said before its a tool for description
- before justifying it i will first explain the basic principles for
  those who are unfamiliar.
- pitch set 4 members corresponding to an a major chord.
- below is the corresponding pitch class set
- with the octave information removed
- 
- pitch class: residue class modulo 12 of the pitchs
- ignore repeated 9
- set class groups pitch class sets which are transpositions of each
  other.
- prime form is a convention for notating set class. with entries
  packed most tightly left and starting on zero.
- forte name is another convention for ordering and naming scs.
- 3-11B just means the 11th set of size 3. the B is not important for
  this explanation.
*** Set class theory - why?
- so that was the what now the why
- it fulfills the mid-level critera i specified earlier
  - in that any collection of pitchs can be represented by a set class
    regardless of any specific harmonic role.
  - so its systematic in that respect.
- it has a degree of perceptual relevance
  - octave equivelance and transpositional equivelance both have a
    solid basis in perception.
- the benefits:
  - it provides a substantial reduction in information whilst
    remaining systematic and perceptually relevant.
- differences:
  - all the relations ships are relative
  - meaning it does not capture absolute note and chord labels only
    types.
*** Set Class Similarity Measures - What and Why
- what are they?
  - models that attempt to quantify the similarity ordistance between
    2 set classes.
  - there are countless different models starting from a wide range of
    fundamental principles.
- for the most part they work by comparing the subsets of two set classes.
- why?
  - this goes back to the second part of the problem.
  - these measures are musical
  - although the perceptual relevance has only be examined
    sporadically and inconclusively...
  - these measures were designed to reflect musical intuitions.
*** Set Class Similarity Measures - Survey
- objective 3 - the survey
- i surveys 25+ measures
- categorised them according to
  - how systematic their approach
  - and how perceptually relevant
- the outcome was to select 6 measure from 4 theorists.
- and examine the values they produced for common tonal objects such
  as chords and scales.
- the preliminary conclusions were that different measures have
  different capabilities and discriminatory power.
- each might potentially be useful in a certain context.
*** Segmentation
- so now the final part of the methodology: segmentation.
- this is a crucial stage as the scale of observation greatly affects
  the tonality of a piece.
- so for this method i propose two segmentation methods to be used in
  conjustion.
  1. fisrt a fully systematic method (from the work of agustin)
     - this provides the complete sc contents of a piece
  2. second a sliding window
     - with fixed window and hope size
     - for tuneing in to sets on interest
     - i will explain... later
*** Segmentation - Fully systematic
- to demonstrate how the two methods work in conjunction i will use an
  example.
- its this piece which some people may know.
- so first we apply the systematic segmentation
- which exhaustively records every combination of adjacent notes
- so that every possible set class is recorded
*** Segmentation - Fully Systematic
- a useful intermediate representation of this data is the
  class-vector.
- which shows the activation time of each set class as a proportion of
  the total duration.
- from this its possible to see a global picture of the set class
  contents and deduce certain things about the sonority
- for example:
*** Segmentation - Sliding window
- so now the sliding window.
- we need to select a window and hop size
- this depends on the "sets of interest"
