finalpresentation.html

<div id="outline-container-15-24" class="outline-3">
<h3 id="sec-15-24"><span class="section-number-3">15.24</span> Conclusions</h3>
<div class="outline-text-3" id="text-15-24">

<ul>
<li>approach:
</li>
<li>that is, objectives 1 and 2,
</li>
<li>this work has demonstrated the capability of systematic set class
  descritpions to convey useful musical information.
</li>
<li>analysis outcomes: so objectives 4 and 5.
</li>
<li>the experiments ive done have constituted a preliminary examination
  of the complex relationship between the various parameters.
</li>
<li>they have also revealed that the 
</li>
</ul>

</div>

</div>

<div id="outline-container-15-25" class="outline-3">
<h3 id="sec-15-25"><span class="section-number-3">15.25</span> Future Work</h3>
<div class="outline-text-3" id="text-15-25">

<ul>
<li>
</li>
</ul>




</div>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Presentation Script again</h2>
<div class="outline-text-2" id="text-16">


</div>

<div id="outline-container-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> Introduction</h3>
<div class="outline-text-3" id="text-16-1">


</div>

<div id="outline-container-16-1-1" class="outline-4">
<h4 id="sec-16-1-1"><span class="section-number-4">16.1.1</span> Definitions</h4>
<div class="outline-text-4" id="text-16-1-1">

<ul>
<li>Clarification
<ul>
<li>tonal analysis
</li>
<li>Set class theory
</li>
<li>similarity measures
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-16-1-2" class="outline-4">
<h4 id="sec-16-1-2"><span class="section-number-4">16.1.2</span> Problem</h4>
<div class="outline-text-4" id="text-16-1-2">

<ol>
<li>existing approaches to tonal analysis lack depth.
<ul>
<li>the predominant use of template matching for chord and key
     estimation gives systems a narrow view of tonality and restrict
     it in many cases to major-minor paradigm, which is insufficient
     for even some western music.
</li>
</ul>

</li>
<li>the use of non-musical similarity measures
<ul>
<li>such as correlation and euclidean distance.
</li>
<li>the use of these purely mathematical measures seems inappropriate
     when considering musical objects.
</li>
</ul>

</li>
</ol>

</div>

</div>

<div id="outline-container-16-1-3" class="outline-4">
<h4 id="sec-16-1-3"><span class="section-number-4">16.1.3</span> Objectives</h4>
<div class="outline-text-4" id="text-16-1-3">

<ol>
<li>adopt a systematic approach to description
</li>
<li>use set class theory
<ul>
<li>justify
</li>
<li>position
</li>
</ul>

</li>
<li>survey similarity measures
</li>
<li>develop techniques for the representation of set class data
   utilising these similarity measures.
</li>
<li>demonstrate the capabilities of the method through specific
   analysis examples.
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> Methodology</h3>
<div class="outline-text-3" id="text-16-2">


</div>

<div id="outline-container-16-2-1" class="outline-4">
<h4 id="sec-16-2-1"><span class="section-number-4">16.2.1</span> Systematic description</h4>
<div class="outline-text-4" id="text-16-2-1">

<ul>
<li>this addresses objective 1
</li>
<li>and explains the fundamental basis to my approach.
</li>
<li>what does it mean to be systematic.
</li>
<li>the key here, is not base the description on high level concepts
  such as chord and key, which is restrictive.
</li>
<li>instead base it on mid-level concepts such as notes.
</li>
<li>mid-level descriptions should be fundamentally independent of high
  level concepts but at the same time capable of capturing them.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-2" class="outline-4">
<h4 id="sec-16-2-2"><span class="section-number-4">16.2.2</span> Set class theory - what?</h4>
<div class="outline-text-4" id="text-16-2-2">

<ul>
<li>before addressing objective 2 i will explain the basic principles
  for those who are unfamiliar.
</li>
<li>pitch set
</li>
<li>set: ignore order and repetitions
</li>
<li>pitch class: residue class modulo 12 of the pitchs
</li>
<li>ignore repeated 9
</li>
<li>set class groups pitch class sets which are transpositions of each
  other.
</li>
<li>prime form is a convention for notating set class. with entries
  packed most tightly left and starting on zero.
</li>
<li>forte name is another convention for ordering and naming scs.
</li>
<li>3-11B just means the 11th set of size 3. the B is not important for
  this explanation.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-3" class="outline-4">
<h4 id="sec-16-2-3"><span class="section-number-4">16.2.3</span> Set class theory - why?</h4>
<div class="outline-text-4" id="text-16-2-3">

<ul>
<li>so that was the what now the why
</li>
<li>it fulfills the mid-level critera i specified earlier
<ul>
<li>in that any collection of pitchs can be represented by a set class
    regardless of any specific harmonic role.
</li>
<li>so its systematic in that respect.
</li>
</ul>

</li>
<li>it has a degree of perceptual relevance
<ul>
<li>octave equivelance and transpositional equivelance both have a
    solid basis in perception.
</li>
</ul>

</li>
<li>the benefits:
<ul>
<li>it provides a substantial reduction in information whilst
    remaining systematic and perceptually relevant.
</li>
</ul>

</li>
<li>differences:
<ul>
<li>all the relations ships are relative
</li>
<li>meaning it does not capture absolute note and chord labels only
    types.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-4" class="outline-4">
<h4 id="sec-16-2-4"><span class="section-number-4">16.2.4</span> Set Class Similarity Measures - What and Why</h4>
<div class="outline-text-4" id="text-16-2-4">

<ul>
<li>what are they?
<ul>
<li>models that attempt to quantify the similarity ordistance between
    2 set classes.
</li>
<li>there are countless different models starting from a wide range of
    fundamental principles.
</li>
</ul>

</li>
<li>for the most part they work by comparing the subsets of two set classes.
</li>
<li>why?
<ul>
<li>this goes back to the second part of the problem.
</li>
<li>these measures are musical
</li>
<li>although the perceptual relevance has only be examined
    sporadically and inconclusively&hellip;
</li>
<li>these measures were designed to reflect musical intuitions.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-5" class="outline-4">
<h4 id="sec-16-2-5"><span class="section-number-4">16.2.5</span> Set Class Similarity Measures - Survey</h4>
<div class="outline-text-4" id="text-16-2-5">

<ul>
<li>objective 3 - the survey
</li>
<li>i surveys 25+ measures
</li>
<li>categorised them according to
<ul>
<li>how systematic their approach
</li>
<li>and how perceptually relevant
</li>
</ul>

</li>
<li>the outcome was to select 6 measure from 4 theorists.
</li>
<li>and examine the values they produced for common tonal objects such
  as chords and scales.
</li>
<li>the preliminary conclusions were that different measures have
  different capabilities and discriminatory power.
</li>
<li>each might potentially be useful in a certain context.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-6" class="outline-4">
<h4 id="sec-16-2-6"><span class="section-number-4">16.2.6</span> Segmentation</h4>
<div class="outline-text-4" id="text-16-2-6">

<ul>
<li>so now the final part of the methodology: segmentation.
</li>
<li>this is a crucial stage as the scale of observation greatly affects
  the tonality of a piece.
</li>
<li>so for this method i propose two segmentation methods to be used in
  conjustion.
<ol>
<li>fisrt a fully systematic method (from the work of agustin)
<ul>
<li>this provides the complete sc contents of a piece
</li>
</ul>

</li>
<li>second a sliding window
<ul>
<li>with fixed window and hope size
</li>
<li>for tuneing in to sets on interest
</li>
<li>i will explain&hellip; later
</li>
</ul>

</li>
</ol>

</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-7" class="outline-4">
<h4 id="sec-16-2-7"><span class="section-number-4">16.2.7</span> Segmentation - Fully systematic</h4>
<div class="outline-text-4" id="text-16-2-7">

<ul>
<li>to demonstrate how the two methods work in conjunction i will use an
  example.
</li>
<li>its this piece which some people may know.
</li>
<li>so first we apply the systematic segmentation
</li>
<li>which exhaustively records every combination of adjacent notes
</li>
<li>so that every possible set class is recorded
</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-8" class="outline-4">
<h4 id="sec-16-2-8"><span class="section-number-4">16.2.8</span> Segmentation - Fully Systematic</h4>
<div class="outline-text-4" id="text-16-2-8">

<ul>
<li>a useful intermediate representation of this data is the
  class-vector.
</li>
<li>which shows the activation time of each set class as a proportion of
  the total duration.
</li>
<li>from this its possible to see a global picture of the set class
  contents and deduce certain things about the sonority
</li>
<li>for example:
</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-9" class="outline-4">
<h4 id="sec-16-2-9"><span class="section-number-4">16.2.9</span> Segmentation - Sliding window</h4>
<div class="outline-text-4" id="text-16-2-9">

<ul>
<li>so now the sliding window.
</li>
<li>we need to select a window and hop size
</li>
<li>this depends on the "sets of interest"
</li>
</ul>

</div>

</div>
