finalpresentation.org
*** segmentation - sliding window
- so say for example we want to capture major triads in our sliding
  window
- we can use information from the systematic segmentation to inform
  our parameter selection.
- this plot shows, for each set class, the average segment length in
  which it occurs.
- so for major triads (3-11B) we can see they mainly occur in segments
  around 2 beats
*** Segmentation - sliding window
- so using this information
- we set the window size to 2 beats and hop size to 1 beat
- and we can view the contents of our sliding window in relation to
  the class vector from before.
- this is shown here with the class vector in blue and the sliding
  window contents in red.
- so you can see we capture a high proportion of major triads as well
  as some of these other set classes.
** Representaion
*** Representation
- so now we have segmented and tuned into our sets of interest.
- we need to represent the data.
- here i will describe the three representation techniques that use
  the set class similarity measures.
*** Distance plot
- first there is the distance plot
- the main idea of the distance plot is to represent the tonal change
  in time with respect to a comparison set
- there are three interdependent parameters here that need selecting:
  - window and hop size determine the captured sc contents
  - which should be targeted according to their relationship to the
    comparison set.
  - this relationship is determined by the measure used.
- here is the resulting distance plot from the sliding window applied
  earlier.
- with a comparison set of 3-11B major triad.
- the points where the curve goes to zero are where the segment and
  the comparison set coincide.
- the higher points of the curve indicate a departure from major
  triads to possible more complex or less familiar chords.
- as you can see there is some element of repetition to the curve.
*** Autocorrelation
- and thats where the next representation comes in.
- autocorrelation: which im sure everyone is familiar with.
- this is the auto correlation of the distance plot you just saw.
- as you can see there are peaks occuring at regular intervals
- indicating that some tonal aspect of the music is repeating
  regularly at 2 and 4 bar intervals.
*** SSM
- the final technique is SSM
- which again im sure everyone is familiar with.
- this despenses with the comparison set and instead compares each
  segment to every other.
- this is a good way of finding repetitions in a time series.
- so here is the SSM of previous example.
- you can the familiar diagonal down the middle
- and there are a few other features specifically this diagonal which
  ive highlighted
- and it corresponds to this passage from bars 7-11 which is repeated
  in bars 15 to 19 with a transposition.
*** Analysis Tool
- so those are the three representation techniques.
- the complex relation ship between the parameters makes it desireable
  to work in an interactive and exploratory environment.
- so i develiped this tool which combines all the techniques into a
  single matlab gui.
- so this can act as a kind of test bench and an environment for
  conducting preliminary experiments.
- this is a screen shot displaing the example that i just described.
** Conclusions
- so in terms of the approach:
  - i think that this work demonstrates that set class descriptions
    and representations involving sc similarity measures. are capable
    of relating useful musicological information
  - and that they are a starting point for addressing the this
    research problem.
  - in particular they seem adept in capturing musical structure and
    significant boundaries.
- in terms of the analysis conclusions:
  - the work i have done constitutes preliminary experiments which
    explore the relation ship between the various parameters.
  - and i have some very basic conclusions relating to this in terms
    of what are the sets of interest and why and what measure to use
    etc.
- as for the contribution of this work
  - i think the survey of similarity measures constitues a substantial
    contribution as this information is
    - sparse, not easy to find, not always properly documented
    - so the organisation of this information and the implementation
      of the measures brings helps bring these potentially useful
      tools into the mainstream of music research.
  - secondly the analysis tool:
    - will be invaluable to anyone wishing to explore these techniques
      further.
** Further Work
- so future work
  - well in the near future, and by this i mean potentiall over the
    summer:
    - I intendt to obtain a better understanding of the relationship
      between the parameters.
      - better understanding the set class contents of a piece and
        what different sets signify.
      - what are the sets of interest and why?
      - which measure to use in which context.
      - and this could be achieved through simpler analysis examples.
      - althought the bach prelude.
  - so where is this all leading in the farther future
    - with sufficiant conprehension of how to select parameters
    - an eventual goal of would be using set class information of this
      type as feature vector with which to perform other MIR or music
      research tasks.
    - there are two aspces to this: baring in mind this work occupies
      a mid level perspective. it is neccessary to
      - approach the this mid level description from low level
        descriptions such as those from audio signals
      - approaching high level musicological understanding from the
        mid-level.
    
