finalpresentation.html

<div id="outline-container-16-2-10" class="outline-4">
<h4 id="sec-16-2-10"><span class="section-number-4">16.2.10</span> segmentation - sliding window</h4>
<div class="outline-text-4" id="text-16-2-10">

<ul>
<li>so say for example we want to capture major triads in our sliding
  window
</li>
<li>we can use information from the systematic segmentation to inform
  our parameter selection.
</li>
<li>this plot shows, for each set class, the average segment length in
  which it occurs.
</li>
<li>so for major triads (3-11B) we can see they mainly occur in segments
  around 2 beats
</li>
</ul>

</div>

</div>

<div id="outline-container-16-2-11" class="outline-4">
<h4 id="sec-16-2-11"><span class="section-number-4">16.2.11</span> Segmentation - sliding window</h4>
<div class="outline-text-4" id="text-16-2-11">

<ul>
<li>so using this information
</li>
<li>we set the window size to 2 beats and hop size to 1 beat
</li>
<li>and we can view the contents of our sliding window in relation to
  the class vector from before.
</li>
<li>this is shown here with the class vector in blue and the sliding
  window contents in red.
</li>
<li>so you can see we capture a high proportion of major triads as well
  as some of these other set classes.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> Representaion</h3>
<div class="outline-text-3" id="text-16-3">


</div>

<div id="outline-container-16-3-1" class="outline-4">
<h4 id="sec-16-3-1"><span class="section-number-4">16.3.1</span> Representation</h4>
<div class="outline-text-4" id="text-16-3-1">

<ul>
<li>so now we have segmented and tuned into our sets of interest.
</li>
<li>we need to represent the data.
</li>
<li>here i will describe the three representation techniques that use
  the set class similarity measures.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-3-2" class="outline-4">
<h4 id="sec-16-3-2"><span class="section-number-4">16.3.2</span> Distance plot</h4>
<div class="outline-text-4" id="text-16-3-2">

<ul>
<li>first there is the distance plot
</li>
<li>the main idea of the distance plot is to represent the tonal change
  in time with respect to a comparison set
</li>
<li>there are three interdependent parameters here that need selecting:
<ul>
<li>window and hop size determine the captured sc contents
</li>
<li>which should be targeted according to their relationship to the
    comparison set.
</li>
<li>this relationship is determined by the measure used.
</li>
</ul>

</li>
<li>here is the resulting distance plot from the sliding window applied
  earlier.
</li>
<li>with a comparison set of 3-11B major triad.
</li>
<li>the points where the curve goes to zero are where the segment and
  the comparison set coincide.
</li>
<li>the higher points of the curve indicate a departure from major
  triads to possible more complex or less familiar chords.
</li>
<li>as you can see there is some element of repetition to the curve.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-3-3" class="outline-4">
<h4 id="sec-16-3-3"><span class="section-number-4">16.3.3</span> Autocorrelation</h4>
<div class="outline-text-4" id="text-16-3-3">

<ul>
<li>and thats where the next representation comes in.
</li>
<li>autocorrelation: which im sure everyone is familiar with.
</li>
<li>this is the auto correlation of the distance plot you just saw.
</li>
<li>as you can see there are peaks occuring at regular intervals
</li>
<li>indicating that some tonal aspect of the music is repeating
  regularly at 2 and 4 bar intervals.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-3-4" class="outline-4">
<h4 id="sec-16-3-4"><span class="section-number-4">16.3.4</span> SSM</h4>
<div class="outline-text-4" id="text-16-3-4">

<ul>
<li>the final technique is SSM
</li>
<li>which again im sure everyone is familiar with.
</li>
<li>this despenses with the comparison set and instead compares each
  segment to every other.
</li>
<li>this is a good way of finding repetitions in a time series.
</li>
<li>so here is the SSM of previous example.
</li>
<li>you can the familiar diagonal down the middle
</li>
<li>and there are a few other features specifically this diagonal which
  ive highlighted
</li>
<li>and it corresponds to this passage from bars 7-11 which is repeated
  in bars 15 to 19 with a transposition.
</li>
</ul>

</div>

</div>

<div id="outline-container-16-3-5" class="outline-4">
<h4 id="sec-16-3-5"><span class="section-number-4">16.3.5</span> Analysis Tool</h4>
<div class="outline-text-4" id="text-16-3-5">

<ul>
<li>so those are the three representation techniques.
</li>
<li>the complex relation ship between the parameters makes it desireable
  to work in an interactive and exploratory environment.
</li>
<li>so i develiped this tool which combines all the techniques into a
  single matlab gui.
</li>
<li>so this can act as a kind of test bench and an environment for
  conducting preliminary experiments.
</li>
<li>this is a screen shot displaing the example that i just described.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-16-4" class="outline-3">
<h3 id="sec-16-4"><span class="section-number-3">16.4</span> Conclusions</h3>
<div class="outline-text-3" id="text-16-4">

<ul>
<li>so in terms of the approach:
<ul>
<li>i think that this work demonstrates that set class descriptions
    and representations involving sc similarity measures. are capable
    of relating useful musicological information
</li>
<li>and that they are a starting point for addressing the this
    research problem.
</li>
<li>in particular they seem adept in capturing musical structure and
    significant boundaries.
</li>
</ul>

</li>
<li>in terms of the analysis conclusions:
<ul>
<li>the work i have done constitutes preliminary experiments which
    explore the relation ship between the various parameters.
</li>
<li>and i have some very basic conclusions relating to this in terms
    of what are the sets of interest and why and what measure to use
    etc.
</li>
</ul>

</li>
<li>as for the contribution of this work
<ul>
<li>i think the survey of similarity measures constitues a substantial
    contribution as this information is
<ul>
<li>sparse, not easy to find, not always properly documented
</li>
<li>so the organisation of this information and the implementation
      of the measures brings helps bring these potentially useful
      tools into the mainstream of music research.
</li>
</ul>

</li>
<li>secondly the analysis tool:
<ul>
<li>will be invaluable to anyone wishing to explore these techniques
      further.
</li>
</ul>

</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-16-5" class="outline-3">
<h3 id="sec-16-5"><span class="section-number-3">16.5</span> Further Work</h3>
<div class="outline-text-3" id="text-16-5">

<ul>
<li>so future work
<ul>
<li>well in the near future, and by this i mean potentiall over the
    summer:
<ul>
<li>I intendt to obtain a better understanding of the relationship
      between the parameters.
<ul>
<li>better understanding the set class contents of a piece and
        what different sets signify.
</li>
<li>what are the sets of interest and why?
</li>
<li>which measure to use in which context.
</li>
<li>and this could be achieved through simpler analysis examples.
</li>
<li>althought the bach prelude.
</li>
</ul>

</li>
</ul>

</li>
<li>so where is this all leading in the farther future
<ul>
<li>with sufficiant conprehension of how to select parameters
</li>
<li>an eventual goal of would be using set class information of this
      type as feature vector with which to perform other MIR or music
      research tasks.
</li>
<li>there are two aspces to this: baring in mind this work occupies
      a mid level perspective. it is neccessary to
<ul>
<li>approach the this mid level description from low level
        descriptions such as those from audio signals
</li>
<li>approaching high level musicological understanding from the
        mid-level.
</li>
</ul>

</li>
</ul>

</li>
</ul>

</li>
</ul>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-07-02T14:11+0200</p>
<p class="author">Author: Nick</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
